articles/sat-solver.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Let's write a simple SAT-solver</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="raventid" />
<link rel="icon" type="image/png" href="/assets/favicon.png" />
<link rel="stylesheet" href="/assets/styles.css" />
</head>
<body>
<header id="site-header" class="status">
<nav>
  <a class="site-title" href="/index.html">raventid</a>
  <span class="site-links">
    <a href="/index.html">home</a>
    <a href="/about.html">about</a>
    <a href="https://github.com/raventid">github</a>
  </span>
</nav>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Let&rsquo;s write a simple SAT-solver</h1>
<p class="subtitle" role="doc-subtitle">July 6, 2026</p>
</header><p>
Good news is that if something in this article is not detailed enough or confusing, you can work with LLM assistant to figure this out. Research shows that any modern LLM is good enough to develop SMT-solver from scratch.
LLM2SMT: Building an SMT Solver with Zero Human-Written Code <a href="https://arxiv.org/pdf/2603.06931">https://arxiv.org/pdf/2603.06931</a>
</p>

<p>
Okay, let&rsquo;s write a simple SAT-solver and try to learn a bit of theory behind it. I usually like to unpack all the abbreviatures, so we do not have any magical words,
SAT is the Boolean satisfiability problem (sometimes called propositional satisfiability problem and abbreviated SATISFIABILITY, SAT or B-SAT) (<a href="https://en.wikipedia.org/wiki/Boolean_satisfiability_problem">https://en.wikipedia.org/wiki/Boolean_satisfiability_problem</a>)
</p>

<p>
We will use Rust programming language, but because from an implementation perspective SAT-solver is not the most complicated subject you can try to use any programming language.
We will have some imperative constructions and mutations though, so purely theoretical functional programming languages might require a bit of creativity to follow this article.
Though I assume if you use such a language you know those tricks.
</p>


<p>
First, let&rsquo;s create a new Cargo project, where we will implement our SAT-solver.
</p>

<pre class="example" id="org79b7efc">
smt-rs git:(main) cargo init
    Creating binary (application) package
note: see more `Cargo.toml` keys and their definitions at https://doc.rust-lang.org/cargo/reference/manifest.html
</pre>


<p>
Before we write some code, let&rsquo;s figure out what SAT-solver should do. SAT asks: given a Boolean formula over variables x<sub>1</sub>, x<sub>2</sub>, …, is there an assignment of <code>true</code> and <code>false</code> values that makes the whole formula <code>true</code>?
</p>

<p>
Solvers work on formulas in conjunctive normal form (<a href="https://en.wikipedia.org/wiki/Conjunctive_normal_form">https://en.wikipedia.org/wiki/Conjunctive_normal_form</a>) (CNF) - an AND of clauses, where each clause is an OR of literals, and a literal is a variable or its negation.
</p>

<p>
Any Boolean formula can be converted to CNF, so this loses no generality.
</p>

<p>
We will implement DPLL (Davis–Putnam–Logemann–Loveland, 1962), which is the simplest thing anyone would actually call a SAT solver — it&rsquo;s brute-force backtracking plus exactly two ideas: simplify the formula after every assignment, and never guess when a value is forced. It&rsquo;s also the skeleton that every modern solver is still built on.
</p>

<p>
You might be a bit confused by terms like <code>forced</code> and <code>CNF</code> and a few other ideas. This is quite normal and we will elaborate on every topic later, because it is easier to understand SAT from a practical example that a theory. Later, after finishing this article you can get back to those first paragraphs and it will be cristally clear to you.
</p>

<p>
So let me show you some pieces of code.
</p>


<p>
The code uses a variant of the standard DIMACS convention (<a href="https://web.archive.org/web/20190325181937/https://www.satcompetition.org/2009/format-benchmarks2009.html">https://web.archive.org/web/20190325181937/https://www.satcompetition.org/2009/format-benchmarks2009.html</a>): a variable is a positive integer, and a literal is 3 (meaning &ldquo;x<sub>3</sub> is <code>true</code>&rdquo;) or -3 (meaning &ldquo;x<sub>3</sub> is <code>false</code>&rdquo;)
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">type</span> <span class="org-type">Literal</span> = <span class="org-type">i32</span>;
</pre>
</div>

<p>
A Clause is a connection of 2 literals, do not be confused by a vec!, it is always just 2 elements (TODO: proof-check) so it is Literal<sub>1</sub> &or; Literal<sub>2</sub> &or; Literal<sub>3</sub>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">type</span> <span class="org-type">Clause</span> = <span class="org-preprocessor">vec!</span>[<span class="org-type">Literal</span>];
</pre>
</div>


<p>
A final element we need is a Formula - this is the whole expression we want to check Clause<sub>1</sub> &and; Clause<sub>2</sub> &and; Clause<sub>3</sub>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">type</span> <span class="org-type">Formula</span> = <span class="org-preprocessor">vec!</span>[<span class="org-type">Clause</span>];
</pre>
</div>


<p>
Okay, so we have our Literals, Clauses and Formula! How to proceed? Two boundary facts drive the entire algorithm. A formula with no clauses is <code>true</code>, because there is nothing left to satisfy (an AND over zero things is <code>true</code>). A clause with no literals is <code>false</code>, because there is no way left to satisfy it (an OR over zero things is <code>false</code>). The solver is engineered so that every step pushes the formula toward one of these two ends: shrink to nothing (SAT) or produce an empty clause (conflict).
</p>

<p>
First function we will need is an assign function, this function will pick a literal make it <code>true</code> and simplify the formulat accordingly (this is sometimes called conditioning)
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">fn</span> <span class="org-function-name">assign</span>(<span class="org-variable-name">formula</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">Formula</span>, <span class="org-variable-name">literal</span>: <span class="org-type">Literal</span>) -&gt; <span class="org-type">Option</span>&lt;<span class="org-type">Formula</span>&gt; {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">simplified</span> = <span class="org-type">Vec</span>::new();

    <span class="org-keyword">for</span> <span class="org-variable-name">clause</span> <span class="org-keyword">in</span> formula {
        <span class="org-keyword">if</span> clause.contains(<span class="org-rust-ampersand">&amp;</span>literal) {
            <span class="org-keyword">continue</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">clause satisfied, remove it entirely
</span>        }
        <span class="org-keyword">let</span> <span class="org-variable-name">reduced</span>: <span class="org-type">Clause</span> =
            clause.iter().copied().filter(|<span class="org-rust-ampersand">&amp;</span>l| l != -literal).collect();
        <span class="org-keyword">if</span> reduced.is_empty() {
            <span class="org-keyword">return</span> <span class="org-type">None</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">every literal in this clause is false: conflict
</span>        }
        simplified.push(reduced);
    }
    <span class="org-type">Some</span>(simplified)
}
</pre>
</div>

<p>
Making literal <code>true</code> has exactly two consequences. Any clause containing literal is now satisfied, so it disappears from the formula entirely. Any clause containing the opposite literal -lit can no longer be satisfied through it, so that literal gets deleted from the clause — the clause survives, but shrunken. If that deletion removes a clause&rsquo;s last literal, we&rsquo;ve falsified the clause and assign returns None to signal a conflict. A useful invariant falls out of this: assign never outputs an empty clause (it returns None instead), so inside the search every clause always has at least one literal.
</p>

<p>
Let me illustrate this with an example: <span class="formula">(x<sub>1</sub> &or; x<sub>2</sub>) &and; (x<sub>3</sub> &or; x<sub>4</sub>) &and; (&not;x<sub>1</sub> &or; x<sub>5</sub>)</span>:
</p>

<p>
Let&rsquo;s pick x<sub>1</sub> and make it <code>true</code>: <span class="formula">(true &or; x<sub>2</sub>) &and; (x<sub>3</sub> &or; x<sub>4</sub>) &and; (&not;x<sub>1</sub> &or; x<sub>5</sub>)</span>
Now we can remove clause 1! Why? because inside the clause we always use &or;, and only one <code>true</code> is enough to convert whole clause into the <code>true</code>!
</p>

<p>
So, we are left with <span class="formula">(x<sub>3</sub> &or; x<sub>4</sub>) &and; (&not;x<sub>1</sub> &or; x<sub>5</sub>)</span>
</p>

<p>
We removed all the clauses with x<sub>1</sub>, but we didn&rsquo;t touch &not;x<sub>1</sub> clauses yet (because in DIMACS notation we searched for 1, but we didn&rsquo;t search for -1). We are doing it now in the <code>reduced</code> action.
</p>

<pre class="example" id="org4d50033">
(x3 ∨ x4) ∧ (¬x1 ∨ x5)
             ^ here is our ¬x1!
</pre>

<p>
Now the logic is this one, we already picked x<sub>1</sub> as a <code>true</code> and simplified the whole formula based on the fact it is <code>true</code>. So we cannot just repick <code>false</code> easily. It means that &not;x<sub>1</sub> is gonna be <code>false</code> in this clause and <code>false</code> cannot help us to convert clause to <code>true</code>, so we remove it (think through, why do we do this?).
</p>

<p>
Now we will do an extra check, let&rsquo;s look at our simplified formula:
</p>

<pre class="example" id="org3e6d3c0">
(x3 ∨ x4) ∧ (x5)
             ^ this clause is still not empty, we can continue
</pre>

<p>
If it would be empty - there would be no way for us to make it <code>true</code>, because it would mean that &not;x<sub>1</sub> was the last literal there and it was converted to <code>false</code>! So in this case we return <code>None</code> and it means that we were wrong about our assumption that x<sub>1</sub> should be <code>true</code>. Maybe we should try x<sub>2</sub>?
</p>

<p>
One important thing to notice here is that our function does not differentiate between x<sub>1</sub> and &not;x<sub>1</sub>. What I mean by that is that this function idea is to set literal to <code>true</code>, and it could be x<sub>1</sub> literal and &not;x<sub>1</sub> literal. In case caller will ask us to set &not;x<sub>1</sub> to <code>true</code>, we will use <code>-literal</code> to get x<sub>1</sub>. So, <code>-literal</code> in the code above is not transforming x<sub>1</sub> to &not;x<sub>1</sub>, it could also transform &not;x<sub>1</sub> to x<sub>1</sub> (so it is not negation, but reversal).
</p>

<p>
Okay, that is not a complex code right? Let&rsquo;s remember the idea of this function and move forward. What is the idea? To receive Formula and Literal, assume Literal to be <code>true</code>, and simplify formula!
</p>


<p>
To implement our next function we will need a HashMap datastructure from a standard library. In our Model we will store the chosen literal and the value we choose for this literal. So it will look something like this:
</p>

<pre class="example" id="org22867fb">
x1: true
x2: true
x3: false
x4: true
</pre>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">use</span> <span class="org-constant">std</span>::<span class="org-constant">collections</span>::<span class="org-type">HashMap</span>;

<span class="org-keyword">type</span> <span class="org-type">Model</span> = <span class="org-type">HashMap</span>&lt;<span class="org-type">u32</span>, <span class="org-type">bool</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">fn</span> <span class="org-function-name">dpll</span>(<span class="org-keyword">mut</span> <span class="org-variable-name">formula</span>: <span class="org-type">Formula</span>, <span class="org-keyword">mut</span> <span class="org-variable-name">model</span>: <span class="org-type">Model</span>, <span class="org-variable-name">depth</span>: <span class="org-type">usize</span>) -&gt; <span class="org-type">Option</span>&lt;<span class="org-type">Model</span>&gt; {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Step 1 &#8212; UNIT PROPAGATION: a 1-literal clause leaves no choice.
</span>    <span class="org-keyword">while</span> <span class="org-keyword">let</span> <span class="org-type">Some</span>(unit) = formula.iter().find(|c| c.len() == 1).map(|c| c[0]) {
        model.insert(unit.unsigned_abs(), unit &gt; 0);
        <span class="org-keyword">match</span> assign(<span class="org-rust-ampersand">&amp;</span>formula, unit) {
            <span class="org-type">Some</span>(reduced_formula) =&gt; formula = reduced_formula,
            <span class="org-type">None</span> =&gt; <span class="org-keyword">return</span> <span class="org-type">None</span>;
        }
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Step 2 &#8212; SUCCESS TEST: no clauses left means all are satisfied.
</span>    <span class="org-keyword">if</span> formula.is_empty() {
        <span class="org-keyword">return</span> <span class="org-type">Some</span>(model);
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Step 3 &#8212; SPLIT: guess a value, and if the subtree fails, try the other.
</span>    <span class="org-keyword">let</span> <span class="org-variable-name">literal</span> = formula[0][0];
    <span class="org-keyword">for</span> <span class="org-variable-name">choice</span> <span class="org-keyword">in</span> [literal, -literal] {
        <span class="org-keyword">match</span> assign(<span class="org-rust-ampersand">&amp;</span>formula, choice) {
            <span class="org-type">Some</span>(reduced_formula) =&gt; {
                <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">m</span> = model.clone(); <span class="org-comment-delimiter">// </span><span class="org-comment">clone so backtracking forgets it
</span>
                m.insert(choice.unsigned_abs(), choice &gt; 0);
                <span class="org-keyword">if</span> <span class="org-keyword">let</span> <span class="org-type">Some</span>(sat) = dpll(reduced_formula, m, depth + 1) {
                    <span class="org-keyword">return</span> <span class="org-type">Some</span>(sat);
                }
            }
            _ =&gt; <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"CONFLICT: a clause became empty"</span>),
        }
    }
    <span class="org-type">None</span> <span class="org-comment-delimiter">// </span><span class="org-comment">both truth values failed: this branch is unsatisfiable
</span>}
</pre>
</div>

<p>
It is a long function, let&rsquo;s dissect it with an example
</p>

<p>
<span class="formula">(x<sub>1</sub> &or; x<sub>2</sub>) &and; (x<sub>3</sub> &or; x<sub>4</sub>) &and; (&not;x<sub>1</sub> &or; x<sub>5</sub>)</span>
</p>

<p>
Our Model table is empty at first, our Formula is above and depth is 0.
</p>

<p>
What we do at the Step 1 is we are looking for something like this <span class="formula">(&not;x<sub>1</sub>)</span> or <span class="formula">(x<sub>1</sub>)</span>. We are going to call this unit, because it&rsquo;s the sole literal of a unit clause, which is the established name for a clause containing exactly one literal - &ldquo;unit&rdquo; in the sense of unit size, like &ldquo;unit interval&rdquo; or &ldquo;unit vector.&rdquo; The literal inside is called the unit literal, or colloquially just &ldquo;the unit,&rdquo; and the whole loop implements unit propagation (also called Boolean constraint propagation, or BCP, in the literature). The terminology goes back to the original Davis–Putnam work in 1960, where satisfying single-literal clauses was one of the named rules, and it has been the standard vocabulary ever since.
</p>

<p>
Okay, if we find this unit what we do?
</p>

<div class="org-src-container">
<pre class="src src-rust">model.insert(unit.unsigned_abs(), unit &gt; 0);
</pre>
</div>

<p>
If we think in the DIMACS encoding our unit literal is 1 for x<sub>1</sub> and -1 for &not;x<sub>1</sub>. As you remember - the whole goal we are trying to reach is to convert whole formula to <code>true</code>. So if we see <span class="formula">(x<sub>1</sub>)</span> we understand that it should be <code>true</code> to convert this clause to <code>true</code>. If we see <span class="formula">(&not;x<sub>1</sub>)</span> then x<sub>1</sub> should be <code>false</code>, to convert clause to <code>true</code>!
</p>

<p>
So we record the value in the table! The rust line of code above is just a way to do it in a bit more fancy and terse way, you can use pen and paper to check how this line of code behave with different values.
</p>

<p>
Next step is crucial, we call our assign function we just implemented above! Do you remmeber what it does? It simplifies formula! So we will call it and save simplified formula into our formula ( I will call it reduced formula, but not sure paper used exactly this word (TODO: double check) )
</p>

<p>
Step 2 is easy, if our formula was reduced to an empty formula () - than we converted everything to <code>true</code>, so we reached our goal, yay!!! We can return Model (our table with values of Literals) to the caller - this is the combination that works! Could it be, that there are multiple combinations that work? Yes, we will return the first one we found, but later when you develop SMT-solver you will see why it is nice to have more than 1 solution to the problem.
</p>


<p>
Step 3. In case we don&rsquo;t have an obvious unit clause to simplify like in Step 1, we will just try to guess! We will pick the first literal we see in the formula and try to run assign (reduction) with Literal and with -Literal (reverse of Literal), one of this options should give us a valid reduced formula and we can update our model and repeat dpll call recursively.
</p>

<p>
I will not comment every line of code in Step 3, because it is a simple backtracking technic. You can ask LLM to extract this code and illustrate how recurssion will work in this case if you are not confident reading and writing code with this approach.
</p>

<p>
To summurize dpll function will recursively call itself, build Model table and run until it is reduce the Formula to () or to unsolvable state.
</p>

<p>
Termination is guaranteed because every call to assign removes the assigned variable from the formula completely, so each recursion level has strictly fewer variables and the tree depth is at most the variable count. The worst case is still exponential — SAT is NP-complete — but propagation prunes enormous chunks of the tree in practice.
</p>

<p>
Let&rsquo;s try to wire our functions together and run? We just want to add more logging, so we can see the execution trace! I will use standard rust logging facilities.
</p>


<p>
To run this example we need to install two external rust libraries, unfortunetally we are not using std lib only. Add them to your project with:
</p>

<div class="org-src-container">
<pre class="src src-shell">cargo add log env_logger
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-comment-delimiter">// </span><span class="org-comment">DPLL SAT solver with the step-by-step trace routed through the `log` crate.
</span><span class="org-comment-delimiter">//</span><span class="org-comment">
</span><span class="org-comment-delimiter">//   </span><span class="org-comment">cargo run                    -&gt; the full trace: input, result, search events
</span><span class="org-comment-delimiter">//                                   </span><span class="org-comment">(guesses, forcings, conflicts) and state
</span><span class="org-comment-delimiter">//                                   </span><span class="org-comment">snapshots (assignment / formula dumps) &#8212;
</span><span class="org-comment-delimiter">//                                   </span><span class="org-comment">trace is the default, so executing the
</span><span class="org-comment-delimiter">//                                   </span><span class="org-comment">block from org shows everything too
</span><span class="org-comment-delimiter">//   </span><span class="org-comment">RUST_LOG=debug cargo run     -&gt; input, result, and search events only
</span><span class="org-comment-delimiter">//   </span><span class="org-comment">RUST_LOG=error cargo run     -&gt; just the input and the result
</span><span class="org-comment-delimiter">//</span><span class="org-comment">
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Level scheme:
</span><span class="org-comment-delimiter">//   </span><span class="org-comment">println!  the program's actual output: the input echo and the verdict
</span><span class="org-comment-delimiter">//   </span><span class="org-comment">debug!    events that shape the search: decide, unit forcing, conflict,
</span><span class="org-comment-delimiter">//             </span><span class="org-comment">backtrack, satisfied
</span><span class="org-comment-delimiter">//   </span><span class="org-comment">trace!    full state after each step: current assignment and formula
</span>
<span class="org-keyword">use</span> <span class="org-constant">log</span>::{debug, trace};
<span class="org-keyword">use</span> <span class="org-constant">std</span>::<span class="org-constant">collections</span>::<span class="org-type">HashMap</span>;
<span class="org-keyword">use</span> <span class="org-constant">std</span>::<span class="org-constant">io</span>::<span class="org-type">Write</span>;

<span class="org-keyword">type</span> <span class="org-type">Literal</span> = <span class="org-type">i32</span>;
<span class="org-keyword">type</span> <span class="org-type">Clause</span> = <span class="org-type">Vec</span>&lt;<span class="org-type">Literal</span>&gt;;
<span class="org-keyword">type</span> <span class="org-type">Formula</span> = <span class="org-type">Vec</span>&lt;<span class="org-type">Clause</span>&gt;;
<span class="org-keyword">type</span> <span class="org-type">Model</span> = <span class="org-type">HashMap</span>&lt;<span class="org-type">u32</span>, <span class="org-type">bool</span>&gt;; <span class="org-comment-delimiter">// </span><span class="org-comment">variable number -&gt; chosen value
</span>
<span class="org-keyword">fn</span> <span class="org-function-name">assign</span>(<span class="org-variable-name">formula</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">Formula</span>, <span class="org-variable-name">literal</span>: <span class="org-type">Literal</span>) -&gt; <span class="org-type">Option</span>&lt;<span class="org-type">Formula</span>&gt; {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">simplified</span> = <span class="org-type">Vec</span>::new();
    <span class="org-keyword">for</span> <span class="org-variable-name">clause</span> <span class="org-keyword">in</span> formula {
        <span class="org-keyword">if</span> clause.contains(<span class="org-rust-ampersand">&amp;</span>literal) {
            <span class="org-keyword">continue</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">clause satisfied, remove it entirely
</span>        }
        <span class="org-keyword">let</span> <span class="org-variable-name">reduced</span>: <span class="org-type">Clause</span> =
            clause.iter().copied().filter(|<span class="org-rust-ampersand">&amp;</span>l| l != -literal).collect();
        <span class="org-keyword">if</span> reduced.is_empty() {
            <span class="org-keyword">return</span> <span class="org-type">None</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">every literal in this clause is false: conflict
</span>        }
        simplified.push(reduced);
    }
    <span class="org-type">Some</span>(simplified)
}

<span class="org-keyword">fn</span> <span class="org-function-name">dpll</span>(<span class="org-keyword">mut</span> <span class="org-variable-name">formula</span>: <span class="org-type">Formula</span>, <span class="org-keyword">mut</span> <span class="org-variable-name">model</span>: <span class="org-type">Model</span>, <span class="org-variable-name">depth</span>: <span class="org-type">usize</span>) -&gt; <span class="org-type">Option</span>&lt;<span class="org-type">Model</span>&gt; {
    <span class="org-keyword">let</span> <span class="org-variable-name">pad</span> = <span class="org-string">"    "</span>.repeat(depth); <span class="org-comment-delimiter">// </span><span class="org-comment">indent log output by recursion depth
</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">Step 1 &#8212; unit propagation.
</span>    <span class="org-keyword">while</span> <span class="org-keyword">let</span> <span class="org-type">Some</span>(unit) = formula.iter().find(|c| c.len() == 1).map(|c| c[0]) {
        model.insert(unit.unsigned_abs(), unit &gt; 0);
        <span class="org-keyword">let</span> (l, a) = (lit_str(unit), assign_str(unit));
        <span class="org-preprocessor">debug!</span>(<span class="org-string">"{pad}unit clause ({l}) forces {a}"</span>);
        <span class="org-keyword">match</span> assign(<span class="org-rust-ampersand">&amp;</span>formula, unit) {
            <span class="org-type">Some</span>(reduced_formula) =&gt; formula = reduced_formula,
            <span class="org-type">None</span> =&gt; {
                <span class="org-preprocessor">debug!</span>(<span class="org-string">"{pad}CONFLICT: a clause became empty"</span>);
                <span class="org-keyword">return</span> <span class="org-type">None</span>;
            }
        }
        <span class="org-preprocessor">trace!</span>(<span class="org-string">"{pad}assignment: {}"</span>, model_str(<span class="org-rust-ampersand">&amp;</span>model));
        <span class="org-preprocessor">trace!</span>(<span class="org-string">"{pad}formula:    {}"</span>, formula_str(<span class="org-rust-ampersand">&amp;</span>formula));
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Step 2 &#8212; success test.
</span>    <span class="org-keyword">if</span> formula.is_empty() {
        <span class="org-preprocessor">debug!</span>(<span class="org-string">"{pad}SATISFIED: no clauses remain"</span>);
        <span class="org-keyword">return</span> <span class="org-type">Some</span>(model);
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Step 3 &#8212; split on the first literal of the first clause.
</span>    <span class="org-keyword">let</span> <span class="org-variable-name">literal</span> = formula[0][0];
    <span class="org-keyword">for</span> <span class="org-variable-name">choice</span> <span class="org-keyword">in</span> [literal, -literal] {
        <span class="org-preprocessor">debug!</span>(<span class="org-string">"{pad}decide {} (guess)"</span>, assign_str(choice));
        <span class="org-keyword">match</span> assign(<span class="org-rust-ampersand">&amp;</span>formula, choice) {
            <span class="org-type">Some</span>(reduced_formula) =&gt; {
                <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">m</span> = model.clone(); <span class="org-comment-delimiter">// </span><span class="org-comment">clone so backtracking forgets it
</span>                m.insert(choice.unsigned_abs(), choice &gt; 0);
                <span class="org-preprocessor">trace!</span>(<span class="org-string">"{pad}assignment: {}"</span>, model_str(<span class="org-rust-ampersand">&amp;</span>m));
                <span class="org-preprocessor">trace!</span>(<span class="org-string">"{pad}formula:    {}"</span>, formula_str(<span class="org-rust-ampersand">&amp;</span>reduced_formula));
                <span class="org-keyword">if</span> <span class="org-keyword">let</span> <span class="org-type">Some</span>(sat) = dpll(reduced_formula, m, depth + 1) {
                    <span class="org-keyword">return</span> <span class="org-type">Some</span>(sat);
                }
            }
            _ =&gt; <span class="org-preprocessor">debug!</span>(<span class="org-string">"{pad}CONFLICT: a clause became empty"</span>),
        }
        <span class="org-preprocessor">debug!</span>(<span class="org-string">"{pad}backtrack: undo {}"</span>, assign_str(choice));
    }
    <span class="org-type">None</span> <span class="org-comment-delimiter">// </span><span class="org-comment">both truth values failed: this branch is unsatisfiable
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">---------------------------------------------------------------------------
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Pretty-printing helpers (unchanged). Note that when a log level is
</span><span class="org-comment-delimiter">// </span><span class="org-comment">disabled, its macro arguments are never evaluated, so these calls cost
</span><span class="org-comment-delimiter">// </span><span class="org-comment">nothing in a quiet run.
</span><span class="org-comment-delimiter">// </span><span class="org-comment">---------------------------------------------------------------------------
</span>
<span class="org-keyword">fn</span> <span class="org-function-name">lit_str</span>(<span class="org-variable-name">l</span>: <span class="org-type">Literal</span>) -&gt; <span class="org-type">String</span> {
    <span class="org-keyword">if</span> l &gt; 0 {
        <span class="org-rust-builtin-formatting-macro">format!</span>(<span class="org-string">"x</span><span class="org-rust-string-interpolation">{l}</span><span class="org-string">"</span>)
    } <span class="org-keyword">else</span> {
        <span class="org-rust-builtin-formatting-macro">format!</span>(<span class="org-string">"&#172;x</span><span class="org-rust-string-interpolation">{}</span><span class="org-string">"</span>, -l)
    }
}

<span class="org-keyword">fn</span> <span class="org-function-name">assign_str</span>(<span class="org-variable-name">l</span>: <span class="org-type">Literal</span>) -&gt; <span class="org-type">String</span> {
    <span class="org-rust-builtin-formatting-macro">format!</span>(<span class="org-string">"x</span><span class="org-rust-string-interpolation">{}</span><span class="org-string"> = </span><span class="org-rust-string-interpolation">{}</span><span class="org-string">"</span>, l.unsigned_abs(), l &gt; 0)
}

<span class="org-keyword">fn</span> <span class="org-function-name">model_str</span>(<span class="org-variable-name">m</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">Model</span>) -&gt; <span class="org-type">String</span> {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">vars</span>: <span class="org-type">Vec</span>&lt;(<span class="org-type">u32</span>, <span class="org-type">bool</span>)&gt; = m.iter().map(|(v, b)| (*v, *b)).collect();
    vars.sort();
    <span class="org-keyword">let</span> <span class="org-variable-name">parts</span>: <span class="org-type">Vec</span>&lt;<span class="org-type">String</span>&gt; =
        vars.into_iter().map(|(v, b)| <span class="org-rust-builtin-formatting-macro">format!</span>(<span class="org-string">"x</span><span class="org-rust-string-interpolation">{v}</span><span class="org-string">=</span><span class="org-rust-string-interpolation">{b}</span><span class="org-string">"</span>)).collect();
    <span class="org-rust-builtin-formatting-macro">format!</span>(<span class="org-string">"{{</span><span class="org-rust-string-interpolation">{}</span><span class="org-string">}}"</span>, parts.join(<span class="org-string">", "</span>))
}

<span class="org-keyword">fn</span> <span class="org-function-name">formula_str</span>(<span class="org-variable-name">f</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">Formula</span>) -&gt; <span class="org-type">String</span> {
    <span class="org-keyword">if</span> f.is_empty() {
        <span class="org-keyword">return</span> <span class="org-string">"&lt;no clauses left&gt;"</span>.to_string();
    }
    f.iter()
        .map(|c| {
            <span class="org-keyword">let</span> <span class="org-variable-name">lits</span>: <span class="org-type">Vec</span>&lt;<span class="org-type">String</span>&gt; = c.iter().map(|<span class="org-rust-ampersand">&amp;</span>l| lit_str(l)).collect();
            <span class="org-rust-builtin-formatting-macro">format!</span>(<span class="org-string">"(</span><span class="org-rust-string-interpolation">{}</span><span class="org-string">)"</span>, lits.join(<span class="org-string">" &#8744; "</span>))
        })
        .collect::&lt;<span class="org-type">Vec</span>&lt;<span class="org-type">String</span>&gt;&gt;()
        .join(<span class="org-string">" &#8743; "</span>)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">---------------------------------------------------------------------------
</span>
<span class="org-keyword">fn</span> <span class="org-function-name">main</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Read the level filter from RUST_LOG, falling back to "trace" when the
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">variable is unset &#8212; org-babel runs the block without RUST_LOG, and this
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">is how we hint the logger to still show the full trace there.
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">The .format(..) line strips env_logger's usual "timestamp LEVEL target"
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">prefix so that the trace output is byte-identical to the old
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">println! trace &#8212; delete it to get the standard prefixed format back.
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Logs go to stderr by default; .target keeps everything on stdout.
</span>    <span class="org-keyword">let</span> <span class="org-variable-name">env</span> = <span class="org-constant">env_logger</span>::<span class="org-type">Env</span>::default().default_filter_or(<span class="org-string">"trace"</span>);
    <span class="org-constant">env_logger</span>::<span class="org-type">Builder</span>::from_env(env)
        .target(<span class="org-constant">env_logger</span>::<span class="org-type">Target</span>::<span class="org-type">Stdout</span>)
        .format(|buf, record| <span class="org-rust-builtin-formatting-macro">writeln!</span>(buf, <span class="org-string">"</span><span class="org-rust-string-interpolation">{}</span><span class="org-string">"</span>, record.args()))
        .init();

    <span class="org-comment-delimiter">// </span><span class="org-comment">(x1 &#8744; x2) &#8743; (&#172;x1 &#8744; x3) &#8743; (&#172;x1 &#8744; &#172;x3) &#8743; (&#172;x2 &#8744; x3)
</span>    <span class="org-keyword">let</span> <span class="org-variable-name">formula</span>: <span class="org-type">Formula</span> = <span class="org-preprocessor">vec!</span>[
        <span class="org-preprocessor">vec!</span>[1, 2],   <span class="org-comment-delimiter">// </span><span class="org-comment">C1
</span>        <span class="org-preprocessor">vec!</span>[-1, 3],  <span class="org-comment-delimiter">// </span><span class="org-comment">C2
</span>        <span class="org-preprocessor">vec!</span>[-1, -3], <span class="org-comment-delimiter">// </span><span class="org-comment">C3
</span>        <span class="org-preprocessor">vec!</span>[-2, 3],  <span class="org-comment-delimiter">// </span><span class="org-comment">C4
</span>    ];

    <span class="org-comment-delimiter">// </span><span class="org-comment">An empty clause in the raw input makes it trivially unsatisfiable.
</span>    <span class="org-keyword">if</span> formula.iter().any(|c| c.is_empty()) {
        <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"RESULT: UNSATISFIABLE (input contains an empty clause)"</span>);
        <span class="org-keyword">return</span>;
    }

    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"input: </span><span class="org-rust-string-interpolation">{}</span><span class="org-string">"</span>, formula_str(<span class="org-rust-ampersand">&amp;</span>formula));
    <span class="org-rust-builtin-formatting-macro">println!</span>();

    <span class="org-keyword">match</span> dpll(formula, <span class="org-type">Model</span>::new(), 0) {
        <span class="org-type">Some</span>(model) =&gt; {
            <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">vars</span>: <span class="org-type">Vec</span>&lt;(<span class="org-type">u32</span>, <span class="org-type">bool</span>)&gt; = model.into_iter().collect();
            vars.sort();
            <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"\nRESULT: SATISFIABLE"</span>);
            <span class="org-keyword">for</span> (v, val) <span class="org-keyword">in</span> vars {
                <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"  x</span><span class="org-rust-string-interpolation">{v}</span><span class="org-string"> = </span><span class="org-rust-string-interpolation">{val}</span><span class="org-string">"</span>);
            }
        }
        <span class="org-type">None</span> =&gt; <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"\nRESULT: UNSATISFIABLE"</span>),
    }
}
</pre>
</div>

<p>
In the code above I added pretty-printers for different structures (you can safely ignore them, they just format the output it has nothing to do with SAT) and also added detailed tracing log to the functions, so now we can run our SAT solver to solve a crazy example:
</p>

<p>
<span class="formula">(x<sub>1</sub> &or; x<sub>2</sub>) &and; (&not;x<sub>1</sub> &or; x<sub>3</sub>) &and; (&not;x<sub>1</sub> &or; &not;x<sub>3</sub>) &and; (&not;x<sub>2</sub> &or; x<sub>3</sub>)</span>
</p>

<p>
Does this expression has a soluion? We can run SAT-solver to figure this out!
</p>

<pre class="example" id="orge3fb278">
input: (x1 ∨ x2) ∧ (¬x1 ∨ x3) ∧ (¬x1 ∨ ¬x3) ∧ (¬x2 ∨ x3)

decide x1 = true (guess)
assignment: {x1=true}
formula:    (x3) ∧ (¬x3) ∧ (¬x2 ∨ x3)
    unit clause (x3) forces x3 = true
    CONFLICT: a clause became empty
backtrack: undo x1 = true
decide x1 = false (guess)
assignment: {x1=false}
formula:    (x2) ∧ (¬x2 ∨ x3)
    unit clause (x2) forces x2 = true
    assignment: {x1=false, x2=true}
    formula:    (x3)
    unit clause (x3) forces x3 = true
    assignment: {x1=false, x2=true, x3=true}
    formula:    &lt;no clauses left&gt;
    SATISFIED: no clauses remain

RESULT: SATISFIABLE
  x1 = false
  x2 = true
  x3 = true
</pre>

<p>
I want comment much on the trace above, as it is quite detailed by itself, now you have all the pieces to understand the basic SAT-solver design and I hope you can see that in it&rsquo;s core it is quite a basic idea! More complexity will come with SMT-solver, but this is a topic for another article! Stay healthy and motivated, see you!
</p>


<p>
P.S. In case you want to see more examples of SAT/SMT - refer to the <a href="https://smt.st/SAT_SMT_by_example.pdf">https://smt.st/SAT_SMT_by_example.pdf</a>
</p>
</main>
<footer id="site-footer" class="status">
<p>© 2026 raventid · woven in <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a> with <a href="https://orgmode.org">org-mode</a></p>
</footer>
</body>
</html>
